Repository: JustCarmen/fancy_treeview
Catalog: language/*.po
Languages: fr, hu, nb, ru, sk

source: <strong>Note</strong>: this option can be time and/or memory consuming, especially on large trees. It can cause very slow page loading or an ’execution time out error’ on your server. If you notice such a behavior, reduce the number of generation blocks to load at once or don’t use it in combination with the option to show singles (see the previous options). If you still experience any problems, don’t use this option at all.
fr: <strong>Remarque :</strong> cette option peut consommer de la ressource en temps et/ou en mémoire, en particulier avec les grands arbres. Elle peut provoquer un chargement de page très lent ou une ’execution time out error’ (erreur de temps d'exécution trop long) sur votre serveur. Si vous remarquez un tel comportement, réduisez le nombre de générations à afficher à la fois ou ne l'utilisez pas en combinaison avec l'option pour afficher les célibataires (voir l'option précédente). Si vous rencontrez toujours des problèmes, n'utilisez pas du tout cette option.
nb: <strong>Merk</strong>: denne operasjonen kan være tid- og minnekrevende, spesielt for store slektstrær. Siden kan lastes veldig sakte , eller gi en ’execution time out error’ på din server. Om du opplever dette, reduser antall generasjoner som skal lastes, eller avstå fra å bruke denne i kombinasjon med single personer (se forrige valg). Om du fortsatt opplever problemer, avstå fra å bruke denne funksjonen.
ru: <strong>Примечание</strong>: этот параметр может увеличить время работы и/или использовать много памяти, особенно с большими деревьями. Это может привести к очень медленной загрузке страницы или ошибке «времени выполнения» на Вашем сервере. Если Вы заметили такое поведение, уменьшите количество блоков поколения для загрузки сразу или не использовать его в сочетании с возможностью просмотра одиноких людей (см. предыдущие варианты). Если у Вас по-прежнему возникают какие-либо проблемы, не используйте эту опцию вообще.
sk: <strong>Poznámka</strong>: táto možnosť môže byť náročná na čas a / alebo pamäť, najmä na veľkých stromoch. Môže to spôsobiť veľmi pomalé načítanie stránky alebo chybu "čas vypršania" na vašom serveri. Ak spozorujete takéto správanie, znížte počet generačných blokov, ktoré sa majú načítať naraz, alebo ich nepoužívajte v kombinácii s možnosťou zobrazovania singlov (pozri predchádzajúce možnosti). Ak stále máte problémy, túto možnosť nepoužívajte vôbec.

source: A Fancy overview of the descendants of one family(branch) in a narrative way.
fr: Aperçu des descendants d’une même famille (branche) de manière narrative.
hu: Fancy áttekintő egy családi(ágazat) utódainak leírása elbeszélő módban.
nb: En presentasjon over etterkommere av en familie eller en person i en fortellende stil.
ru: Родословная роспись - обзор потомков одной семьи (ветви) в повествовательной форме.
sk: Fancy prehľad o potomkoch jednej rodiny (vetvy) v príbehu.

source: By default the PDF icon is visible on the Fancy Treeview page. If you enable this option, a PDF icon is also displayed in the Fancy Treeview tab on the individual page.
fr: Par défaut, l'icône PDF est visible dans la page Fancy Treeview. Si vous activez cette option, une icône PDF s'affiche également dans l'onglet Fancy Treeview de la page individuelle.
nb: Som standard er PDF-ikonet synlig på Fancy Treeview siden. Hvis du aktiverer denne innstillingen vil et PDF-ikon vises på fanen Fancy Treeview for individer.
ru: Значок PDF, по умолчанию отображается на странице 'Родословная роспись'. Если Вы включите эту опцию, значок PDF также будет отображаться на вкладке 'Родословная роспись' на отдельной странице.
sk: Štandardne je ikona PDF viditeľná na stránke Fancy Treeview. Ak túto možnosť povolíte, ikona PDF sa tiež zobrazí na karte Fancy Treeview na jednotlivých stránkach.

source: Change root person
fr: Changer la personne racine
hu: Válasszon kiinduló személyt
nb: Velg annen proband
ru: Изменить основную персону
sk: Zmena koreňovej osoby

source: Check relationship between partners
fr: Vérifiez les relations entre les individus
hu: Társak közti rokoni kapcsolat ellenőrzés
nb: Sjekk slektskap mellom partnere
ru: Проверить отношения между партнерами
sk: Skontrolujte vzťah medzi partnermi

source: Creating PDF file. This process may take a while. Please wait...
fr: Un fichier PDF est créé. Cela peut prendre un certain temps. Veuillez patienter...
hu: PDF fájl létrehozása. Ez a művelet időigényes. Várjon kérem...
nb: Oppretter PDF-fil. Dette kan ta tid. Vennligst vent...
ru: Создание файла PDF. Этот процесс может занять некоторое время. Пожалуйста, подождите...
sk: Vytváram PDF súbor. Tento proces môže chvíľu trvať. Prosím čakajte...

source: Descendants of the %s family
fr: Descendants de la famille %s
hu: A %s család leszármazottai
nb: Etterkommere etter familien %s
ru: Потомки %s
sk: Potomkovia %s rodiny

source: Error: A person with ID %s does not exist in this tree
fr: Erreur : Une personne avec l'ID %s n'existe pas dans cet arbre
hu: Hiba: %s azonosítószámmal rendelkező személy nem található ebben a fában
nb: Feil: En person med ID %s finnes ikke i dette treet
ru: Ошибка: Персона с идентификатором %s не существует в этом дереве
sk: Chyba: V tomto strome neexistuje osoba s ID %s

source: Error: A root person with ID %s already exists
fr: Erreur : Une personne racine avec l'ID %s existe déjà
hu: Hiba: A %s azonosítószámmal rendelkező kiinduló személy már létezik
nb: Feil: Startpersonen med ID %s finnes allerede
ru: Ошибка: Основная персона с идентификатором %s уже существует
sk: Chyba: koreňová osoba s ID%s už existuje

source: Error: The root person belonging to this surname already exists
fr: Erreur: La personne racine pour ce nom est déjà utilisée
hu: Hiba: E családnévbe tartozó kiinduló személy már létezik
nb: Feil: Startpersonen med dette etternavnet finnes allerede
ru: Ошибка: Основной пользователь, принадлежащий этой фамилии, уже существует
sk: Chyba: Koreňová osoba patriaca k tomuto priezvisku už existuje

source: Error: The surname you entered doesn’t exist in this tree.
fr: Erreur: Le nom que vous avez saisi n'existe pas dans cet arbre.
hu: Hiba: A megadott családnév nem fordul elő ebben a fában.
nb: Feil: Etternavnet du skrev inn finnes ikke i slektstreet.
ru: Ошибка: Фамилия, которую Вы ввели, не существует в этом дереве.
sk: Chyba: Priezvisko, ktoré ste zadali, v tomto strome neexistuje.

source: Family tree overview
fr: Vue d'ensemble de l'arbre
hu: Családfa áttekintő
nb: Slektstreoversikt
ru: Обзор семейного дерева
sk: Prehľad o rodinnom strome

source: Fancy Treeview
hu: Fancy Famegjelenítés
ru: Родословная роспись
sk: Efektný stromový pohľad

source: Fancy Treeview PDF
hu: Fancy PDF Famegjelenítés
ru: Родословная роспись PDF
sk: Efektný stromový pohľad PDF

source: Fancy Treeview module extension: offer your users to download a Fancy Treeview page as PDF.
fr: L'extention Fancy Treeview : Offre à vos visiteurs de télécharger une liste des descendants sous forme de fichier PDF.
hu: Fancy Famegjelenítő modul kiterjesztés: A Fancy Famegjelenítő oldal PDF fájl letöltés lehetősége a felhasználóknak.
nb: Fancy Treeview modulutvidelse: tilbyr brukere å laste ned Fancy Treeview-sider som PDF.
ru: Расширенный модуль 'Родословная роспись': предлагает Вашим пользователям загружать страницу 'Родословная роспись' в формате PDF.
sk: Fancy Treeview rozšírenie modulu: ponúknite svojim používateľom, aby si stiahli stránku Fancy Treeview vo formáte PDF.

source: Go
fr: Lancer
hu: Mehet
nb: Utfør
ru: Ок
sk: Ísť

source: He had a relationship with
fr: Il avait une relation avec
nb: Han hadde et forhold med
ru: У него были отношения с
sk: Mal s ním vzťah

source: He married %s times
fr: Il s'est marié %s fois
hu: %s alkalommal házasodott
nb: Han giftet seg %s ganger
ru: Он был женат %s раза
sk: Oženil sa s %s

# PAST
source: He was baptized
fr: Il a été baptisé
hu: Keresztelve
nb: Han ble døpt
ru: Он был крещен
sk: Bol pokrstený

# PRESENT
source: He was baptized
fr: Il a été baptisé
hu: Keresztelve
nb: Han er døpt
ru: Он крещен
sk: Bol pokrstený

# PAST
source: He was born
fr: Il naquit
hu: Született
nb: Han ble født
ru: Он родился
sk: Narodil(la) sa

# PRESENT
source: He was born
fr: Il est né
hu: Született
nb: Han er født
ru: Он родился
sk: Narodil(la) sa

source: Here you can choose to resize the default webtrees thumbnails especially for the Fancy Treeview pages. You can set a custom size in percentage or in pixels. If you choose “no” the default webtrees thumbnails will be used with the formats you have set on the tree configuration page.
fr: Ici vous pouvez choisir de redimensionner les vignettes webtrees par défaut, en particulier pour les pages des arborescences souhaitées. Vous pouvez définir un format personnalisé en pourcentage ou en pixels. Si vous choisissez « non » les vignettes par défaut de webtrees seront utilisés avec les formats que vous avez définis sur la page de configuration de l'arbre.
nb: Her kan du velge å endre størrelse på miniatyrbilder spesielt for Fancy Treeview. Du kan sette størrelse i prosent eller punkter. Dersom du velger «nei» vil standard størrelse for miniatyrbilder benyttes.
ru: Здесь Вы можете изменить стандартный размер Webtrees-миниатюр, особенно для страниц 'Родословная роспись'. Вы можете установить нестандартный размер в процентах или в пикселях. Если Вы выберете «нет», стандартные Webtrees-миниатюры будут использоваться с форматами, которые Вы установили на странице конфигурации дерева.
sk: Tu sa môžete rozhodnúť zmeniť veľkosť predvolených miniatúr webtrees, najmä pre stránky Fancy Treeview. Môžete nastaviť vlastnú veľkosť v percentách alebo v pixeloch. Ak zvolíte "nie", predvolené miniatúry webtrees sa použijú s formátmi, ktoré ste nastavili na stránke s konfiguračným stromom.

source: If you enable this option, a Fancy Treeview tab with the title “Descendants” will be shown on the individual page. The tab will describe the current individual with his family and the next two generations (if there are any). If this individual has more descendants then the two generations shown, a link will be displayed to the full Fancy Treeview Page where this individual will be displayed with all his descendants.
fr: Si vous activez cette option, un onglet Fancy Treeview avec le titre « Descendants » sera affiché sur la page individuelle. L'onglet décrira l'individu en cours avec sa famille et les deux générations suivantes (s'il y en a). Si cette personne a plus de descendants que les deux générations représentées, un lien sera affiché vers la page Fancy Treeview où cet individu sera affiché avec tous ses descendants.
nb: Hvis du aktiverer dette valget vil en Fancy Treeview-fane med tittelen "Etterkommere" bli vist på personsiden. Fanen beskriver vedkommende person med sin familie og de neste to generasjonene, om det er noen. Hvis denne personen har flere etterkommere enn de to generasjonene, vises en lenke til hovedsiden for Fancy Treeview, hvor personen blir vist med alle sine etterkommere.
ru: Если Вы включите этот параметр, на отдельной странице будет присутствовать вкладка родословной росписи с названием «Потомки». В вкладке будет описана текущая персона со своей семьей и следующими двумя поколениями (если они есть). Если у этой персоны больше потомков, то отображается два поколения, ссылка будет отображаться на странице 'Родословной росписи', где эта персона будет отображаться со всеми его потомками.
sk: Ak povolíte túto možnosť, na každej stránke sa zobrazí záložka Fancy Treeview s názvom "Potomkovia". Karta opisuje súčasného jednotlivca so svojou rodinou a nasledujúcimi dvoma generáciami (ak existujú). Ak má tento jedinec viac potomkov, potom budú zobrazené dve generácie, zobrazí sa odkaz na plnú stránku Fancy Treeview, kde sa táto osoba zobrazí so všetkými jeho potomkami.

source: If you have ticked the “Show places” option but NOT the option to abbreviate placenames, you can set your own country here. Full places will be listed on the Fancy Treeview pages, but when a place includes the name of your own country, this name will be left out. If you don’t select a country then all countries will be shown, including your own.
fr: Si vous avez coché l'option « Afficher les lieux », mais pas l'option d'abréger les noms de lieux, vous pouvez définir votre propre lieu ici. Les noms de lieux seront indiqués en entier sur les pages de l'arbre choisi, mais lorsqu'un endroit comprendra le nom de votre propre lieu, ce nom sera laissé de côté. Si vous ne sélectionnez pas de lieu, alors tous les lieux seront présentés, y compris le vôtre.
nb: Hvis du har valgt innstillingen «Vis stedsnavn», kan du sette ditt eget land her. Hele stedsnavn blir vist i rapporten men hvis et sted inkluderer navnet på ditt eget land, blir dette utelatt. Hvis du ikke velger land, blir alle land vist, inkludert ditt eget.
ru: Если Вы отметили опцию «Показывать места», но не можете сокращать имена мест, то здесь Вы можете указать свою страну. Полные места будут указаны на страницах 'Родословная роспись', но когда место включает название Вашей собственной страны, это имя будет опущено. Если Вы не выберите страну, тогда будут показаны все страны, в том числе Ваши собственные.
sk: Ak ste zaškrtli voľbu "Zobraziť miesta", môžete tu nastaviť vlastnú krajinu. Úplné miesta sa zobrazia na stránkach Fancy Treeview, ale ak miesto obsahuje názov vašej vlastnej krajiny, toto meno sa vynechá. Ak nevyberiete krajinu, zobrazia sa všetky krajiny vrátane vašej krajiny.

source: If you have ticked the “Show places” option, you can choose to use the default GEDCOM settings to abbreviate placenames. If you don’t set this option, full place names will be shown.
fr: Si vous avez coché l'option « Afficher les lieux », vous pouvez choisir d'utiliser les paramètres par défaut de GEDCOM pour abréger les noms de lieux. Si vous ne choisissez pas cette option, les noms de lieux complets seront affichés.
nb: Hvis du har huket av «Vis stedsnavn»-alternativet, kan du velge å bruke standard GEDCOM-instillinger for å forkorte stedsnavn. Hvis du ikke setter dette alternativet, vil fullt navn for stedet vist.
ru: Если Вы отметили опцию «Показывать места», Вы можете использовать стандартные настройки GEDCOM для сокращения названия мест. Если Вы не установите этот параметр, будут показаны полные названия мест.
sk: Ak ste začiarkli možnosť Zobraziť miesta, môžete použiť predvolené nastavenia GEDCOM na skrátenie platných mien. Ak túto možnosť nenastavíte, zobrazia sa názvy plných miest.

source: Index
hu: Jegyzék
nb: Indeks
ru: Индекс
sk: zoznam

source: Number of generation blocks to show
fr: Nombre de générations à afficher
hu: Megjelenítendő nemzedékek száma
nb: Antall generasjoner som skal vises
ru: Количество блоков поколений для просмотра
sk: Počet generačných blokov, ktoré sa majú zobraziť

source: Options for %s
fr: Options pour %s
hu: %s beállításai
nb: Valg for %s
ru: Параметры для %s
sk: Možnosti pre %s

source: Or enter an ID
fr: Ou saisir un ID
hu: Vagy adjon meg egy azonosítószámot
nb: Eller skriv inn en ID
ru: или введите ID
sk: Alebo zadajte ID

source: Page title
fr: Titre de page
hu: Oldalnév
nb: Sidetittel
ru: Заголовок страницы
sk: Názov stránky

source: Pages
hu: Oldal
nb: Sider
ru: Страницы
sk: Stránky

source: Read more
fr: En savoir plus
hu: Olvass tovább
nb: Les mer
ru: Подробнее
sk: Čítaj ďalej

source: Resize thumbnails
fr: Redimensionner les vignettes
hu: Bélyegkép átméretezés
nb: Endre størrelse på miniatyrbilder
ru: Изменение размера миниатюр
sk: Zmeniť veľkosť miniatúr

source: Root person
fr: Personne racine
hu: Kiinduló személy
nb: Startperson
ru: Основная персона
sk: Koreňová osoba

source: Search ID by name
fr: Rech. d'ID par le nom
hu: ID keresés név szerint
nb: Søk ID etter navn
ru: Поиск по ID
sk: Vyhľadávania ID podľa názvu

source: Search root person
fr: Personne racine
hu: Kiindulószemély keresés
nb: Søk startperson
ru: Поиск персоны
sk: Vyhľadávať koreňovú osobu

source: Select your country
fr: Sélectionnez votre pays
hu: Válasszon országot
nb: Velg ditt land
ru: Выберите Вашу страну
sk: Vyber svoju krajinu

source: She had a relationship with
fr: Elle avait une relation avec
hu: Rokoni kapcsolat vele
nb: Hun hadde et forhold med
ru: У нее были отношения с
sk: Mala vzťah s

source: She married %s times
fr: Elle s'est mariée %s fois
hu: %s alakalommal házasodott
nb: Hun giftet seg %s ganger
ru: Она выходила замуж %s раза
sk: Ona si vzala %s obdobie

# PAST
source: She was baptized
fr: Elle a été baptisée
hu: Megkeresztelve
nb: Hun ble døpt
ru: Она была крещена
sk: Bola pokrstená

# PRESENT
source: She was baptized
fr: Elle a été baptisée
hu: Megkeresztelve
nb: Hun er døpt
ru: Она крещена
sk: Bola pokrstená

# PAST
source: She was born
fr: Elle naquit
hu: Született
nb: Hun ble født
ru: Она родилась
sk: Sa narodila

# PRESENT
source: She was born
fr: Elle est née
hu: Született
nb: Hun er født
ru: Она родилась
sk: Sa narodila

source: Show a Fancy Treeview tab on the individual page
fr: Afficher un onglet dans « Ma fiche » avec les arborescences proposées
hu: A Fancy Famegjelenítő fül mutatása a Személyoldalon
nb: Vis Fancy Treeview som en fane på personsider
ru: Показать вкладку 'Родословная роспись' на отдельной странице
sk: Na samostatnej stránke zobrazte kartu Fancy Treeview

source: Show a PDF icon in the Fancy Treeview tab
fr: Afficher une icône PDF dans l'onglet Fancy Treeview
hu: PDF képecske mutatása a Fancy Famegjelenítő fülön
nb: Vis et PDF-ikon under fane for Fancy Treeview
ru: Показать значок PDF на вкладке 'Родословная роспись'
sk: Zobraziť ikonu PDF na záložke Fancy Treeview

source: Show form to change start person
fr: Permettre le changement de la personne racine
hu: Kiindulószemély csereűrlap mutatása
nb: Vis søkefelt for å endre startperson
ru: Показать форму для изменения основной персоны
sk: Zobraziť formulár na zmenu štartovacej osoby

source: Show occupations
fr: Affichage les professions
hu: Foglalkozás megjelenítése
nb: Vis yrker
ru: Показывать профессии
sk: Zobraziť povolania

source: Show places
fr: Afficher les lieux
hu: Helyek megjelenítése
nb: Vis stedsnavn
ru: Показать места
sk: Zobraziť miesta

source: Show singles
fr: Afficher les célibataires ?
hu: Egyedülállók megjelenítése
nb: Vis enslige personer
ru: Показать одиноких людей
sk: Zobraziť jednotlivcov

source: Surname in page title
fr: Nom dans le titre de page
hu: Családnév a az oldalnévben
nb: Etternavn i sidetittel
ru: Фамилия в названии страницы
sk: Priezvisko v názve stránky

source: The %s time he married
fr: La %s fois, il épouse
hu: %s alakalommal nősült
nb: Gift %s gang med
ru: В %s раз он женился на
sk: %s si vzal

source: The %s time she married
fr: La %s fois, elle épouse
hu: %s alakalommal ment férjhez
nb: Gift %s gang med
ru: В %s раз она вышла замуж за
sk: %s sa vydala

source: The %s time this individual married
fr: La %s fois que cet individu est marié
hu: %s alakalommal házasodott
nb: %s gangen denne personen giftet seg
ru: В %s раз этот человек женился
sk: %s sa tento človek oženil

source: The details of this generation are private.
fr: Les détails de cette génération sont privés.
hu: E nemzedék adatai nem nyilvánosak.
nb: Detaljene om denne generasjonen er utilgjengelige av personvernhensyn.
ru: Сведения об этой семье являются частными.
sk: Podrobnosti tejto generácie sú súkromné.

source: The options for this tree are succesfully reset to the default settings
fr: Les paramètres de cet arbre ont été réinitialisé avec succès aux paramètres par défaut.
hu: E fa alapértelmezett beállításainak visszaállítása sikeresen megtörtént
nb: Innstillingene for dette slektstreet er tilbakestilt til opprinnelige innstillinger
ru: Параметры этого дерева успешно восстановлены до стандартных настроек
sk: Možnosti tohto stromu sa úspešne obnovia na predvolené nastavenia

source: The options for this tree are succesfully saved
fr: Les options de cet arbre ont été enregistré avec succès.
hu: E fa beállításai sikeres mentése megtörtént
nb: Innstillingene for dette slektstreet er lagret
ru: Параметры этого дерева успешно сохранены
sk: Možnosti pre tento strom sú úspešne uložené

source: The options for this tree are succesfully saved and copied to all other trees
fr: Les paramètres de cet arbre ont été enregistré avec succès et copié sur tout les autres arbres.
hu: E fa beállításai mentése és többi fába való másolása sikeresen megtörtént
nb: Innstillingene for dette slektstreet er lagret og kopiert til alle andre trær
ru: Параметры этого дерева успешно сохранены и скопированы на все другие деревья
sk: Možnosti tohto stromu sú úspešne uložené a skopírované na všetky ostatné stromy

source: The settings for this tree are succesfully updated
fr: Les paramètres de cet arbre sont mis à jour avec succès
hu: E fa beállításainak módosítása sikeresen megtörtént
nb: Innstillingene for dette slektstreet er oppdaterte
ru: Настройки для этого дерева успешно обновились
sk: Nastavenia pre tento strom sú úspešne aktualizované

source: This individual doesn’t exist anymore in this tree
fr: Cet individu n'existe plus dans cet arbre
hu: Ez a személy ebben a fában többé már nem létezik
nb: Personen med start id %s eksisterer ikke lengre i dette treet
ru: Этот человек больше не существует в этом дереве
sk: Tento jedinec už v tomto strome neexistuje

source: This individual had a relationship with
fr: Cet individu a une relation avec
hu: kapcsolatban állt vele
nb: Denne personen hadde et forhold med
ru: У этого человека были отношения с
sk: Tento človek mal vzťah

source: This individual married
fr: Cet individu est marié
hu: házasodott
nb: Denne personen giftet seg
ru: Этот человек женат
sk: Tento človek sa oženil

source: This individual married %s times
fr: Cet individu s'est marié %s fois
hu: %s alkalommal házasodott
nb: Denne personen giftet seg %s ganger
ru: Этот человек женился %s раз
sk: Tento človek sa oženil %s
