Repository: JustCarmen/fancy_treeview
Catalog: language/*.po
Languages: fr, hu, nb, ru, sk

source: This option is especially usefull for large trees. When you notice a slow page load, here you can set the number of generation blocks to load at once to a lower level. Below the last generation block a button will appear to add the next set of generation blocks. The new blocks will be added to the blocks already loaded. Clicking on a “follow” link in the last visible generation block, will also load the next set of generation blocks.
fr: Cette option est particulièrement utile pour les grands arbres. Lorsque vous remarquez qu'une page est lente à charger, ici, vous pouvez diminuer le nombre de blocs de génération à charger à la fois. Après le dernier bloc de génération, un bouton apparaîtra pour afficher la prochaine série de blocs de génération. Les nouveaux blocs seront alors ajoutés aux blocs déjà chargés. En cliquant sur le lien « suivant » dans le dernier bloc de génération visible, la série suivante de blocs de génération sera chargée.
nb: Dette alternativet er spesielt nyttig for større trær. Om du opplever at siden lastes sakte, kan du redusere antall generasjonsblokker som skal lastes samtidig. Under den siste generasjonsblokken vil du se en lenke som lar deg legge til neste sett av generasjonsblokker. De neste blokkene vil bli lagt til de som allerede er lastet. Klikk «neste» etter den siste generasjonsblokken for å laste det neste settet med generasjonsblokker.
ru: Этот параметр особенно полезен для больших деревьев. Когда Вы заметили медленную загрузку страницы, Вы можете установить количество блоков генерации для загрузки, сразу на более низкий уровень. Ниже блока последнего поколения появится кнопка, которая добавит следующий набор блоков поколений. Новые блоки будут добавлены к уже существующим блокам. Нажатие на ссылку «перейти к» в последнем видимом блоке поколений, также загрузит следующий набор блоков поколения.
sk: Táto možnosť je užitočná najmä pre veľké stromy. Ak spozorujete pomalé načítanie stránky, môžete tu nastaviť počet generačných blokov, ktoré sa načítajú naraz na nižšiu úroveň. Pod blokom poslednej generácie sa zobrazí tlačidlo s pridaním ďalšej sady generačných blokov. Nové bloky sa pridajú k už načítaným blokom. Kliknutím na odkaz "sledovať" v poslednom viditeľnom generačnom bloku sa načíta aj ďalšia sada generačných blokov.

source: Thumbnail size
fr: Taille des vignettes
hu: Bélyegkép mérete
nb: Størrelse på miniatyrbilde
ru: Размер миниатюры
sk: Veľkosť miniatúr

source: Turn this option on if you want to display singles in the next generation blocks. Singles are individuals without partner and children. With this option turned on, every child of a family will be displayed in a detailed way in the next generation block.
fr: Activez cette option si vous voulez afficher les célibataires dans les blocs de génération. Les célibataires sont des individus sans conjoint ni enfant. Si cette option est activée, tous les enfants d'une famille seront affichés de manière détaillée dans le bloc de génération suivant.
nb: Aktiver denne innstillingen hvis du vil vise enslige personer i generasjonsavsnittene. Enslige personer er personer uten partner eller barn. Med denne innstillingen aktivert vil alle barn av alle familier bli vist i detalj i neste generasjonsavsnitt.
ru: Включите эту опцию, если вы хотите отображать одиноких в блоках следующего поколения. Одинокие - это люди без партнера и детей. При включении этой опции каждый ребенок в семье будет отображаться детально в блоке следующего поколения.
sk: Zapnite túto možnosť, ak chcete zobraziť jednotlivcov v blokoch novej generácie. Jednotlivci sú jedinci bez partnera a deti. Ak je táto možnosť zapnutá, každé dieťa rodiny sa podrobne zobrazí v bloku novej generácie.

source: Use default GEDCOM settings to abbreviate place names
fr: Utiliser les paramètres par défaut de GEDCOM pour abréger les noms de lieux
nb: Bruke standard GEDCOM innstillinger til å forkorte stedsnavn
ru: Используйте стандартные настройки GEDCOM для сокращения названий мест
sk: Použite predvolené nastavenia GEDCOM na skrátenie názvov miest

source: Use fullname in menu
fr: Utiliser le nom complet dans le menu
hu: Teljes név használata a menüben
nb: Bruk fullt navn i menyen
ru: Использовать полное имя в меню
sk: V ponuke použite celé meno

source: Use square thumbnails
fr: Utiliser des vignettes carrées
hu: Négyzetkép használat
nb: Bruk kvadratiske miniatyrbilder
ru: Использовать квадратные миниатюры
sk: Použite štvorčekové náhľady

source: Use the search form below to search for a root person. After a successful search the Fancy Treeview page will be automatically created. You can add as many root persons as you want.
fr: Utilisez le formulaire ci-dessous pour chercher une personne racine. Après une recherche fructueuse, la page de l'arborescence souhaitée sera automatiquement créé. Vous pouvez ajouter autant de personnes racines que vous le souhaitez.
nb: Bruk søkeskjemaet under for å søke etter en startperson. Etter å ha funnet riktig person, vil etterkommeroversikten opprettes automatisk. Du kan legge til så mange startpersoner som du ønsker.
ru: Используйте поисковую форму ниже для поиска основного человека. После успешного поиска будет автоматически создана страница 'Родословная роспись'. Вы можете добавить столько основных лиц, сколько захотите.
sk: Pomocou vyhľadávacieho formulára nižšie vyhľadajte koreňovú osobu. Po úspešnom vyhľadávaní sa automaticky vytvorí stránka Fancy Treeview. Môžete pridať toľko koreňových osôb, koľko chcete.

source: With this option turned on, the script checks if a (married) couple has the same ancestors. If a relationship between the partners is found, a text will appear between brackets after the spouses’ name to indicate the blood relationship.
fr: Si cette option est activée, le script vérifie si un couple (marié) a les mêmes ancêtres. Si une relation entre les partenaires est trouvée, un texte apparaît entre parenthèses après le nom des époux pour indiquer le lien de sang.
nb: Med dette alternativet aktivert, sjekker skriptet om et (gift) par har samme forfedre. Hvis et forhold mellom to partnere er funnet, vises en tekst i parantes etter ektefellens navn for å indikere forholdet. Merk: Dette alternativet kan forårsake at sider lastes saktere, spesielt for store slektstrær. Hvis du opplever dette, redusér antall generasjoner som skal lastes samtidig (se tidligere alternativ).
ru: Когда этот параметр включен, скрипт проверяет, имеют ли (женатые) пары одних и тех же предков. Если будет найдена связь между партнерами, в скобках после имени супруга появится текст, указывающий на кровное родство.
sk: Ak je táto možnosť zapnutá, skript skontroluje, či má (manželský) pár rovnakých predkov. Ak sa nájde vzťah medzi partnermi, medzi zátvorkami sa objaví text za menom manželov, ktorý označuje pokrvný vzťah.

source: You have installed the Fancy Treeview PDF module. This module won’t work without the Fancy Treeview module enabled. Please enable Fancy Treeview to use this module.
fr: Vous avez installé le module Fancy Treeview PDF. Ce module ne fonctionnera pas sans le module de Fancy Treeview activé. Veuillez activer Fancy Treeview pour utiliser ce module.
nb: Du har installert Fancy Treeview PDF-modulen. Denne modulen fungerer ikke uten at Fancy Treeview-modulen er aktivert. Vennligst aktiver Fancy Treeview for å bruke denne modulen.
ru: Вы установили модуль 'Родословная роспись PDF'. Этот модуль работает с модулем 'Родословная роспись'. Для использования этого модуля, пожалуйста, подключите модуль 'Родословная роспись'.
sk: Nainštalovali ste modul Fancy Treeview PDF. Tento modul nebude fungovať bez povoleného modulu Fancy Treeview. Ak chcete použiť tento modul, povoľte Fancy Treeview.

source: You have installed the Fancy Treeview PDF module. This module won’t work without the correct version of the Fancy Treeview module installed and enabled. Please install and enable Fancy Treeview version %s or higher to use this module. <a href="http://www.justcarmen.nl/fancy-modules/fancy-treeview/">Click here to download the latest release</a>.
fr: Vous avez installé le module Fancy Treeview PDF. Ce module ne fonctionnera pas sans la version correcte du module Fancy Treeview installé et activé. Veuillez installer et activer Fancy Treeview version %s ou supérieure pour utiliser ce module. <a href="http://www.justcarmen.nl/fancy-modules/fancy-treeview/">Cliquez ici pour télécharger la dernière version</a>.
nb: Du har installrt Fancy Treeview PDF-modulen. Denne modulen vil ikke fungere uten at korrekt versjon av Fancy Treeview-modulen er installert og aktivert. Vennligst installer og aktiver Fancy Treeview versjon %s 1 eller høyere for å bruke denne modulen. <a href="http://www.justcarmen.nl/fancy-modules/fancy-treeview/"> 2Klikk her for å laste ned den nyeste utgivelsen</a> 3.
ru: Вы установили модуль 'Родословная роспись PDF'. Этот модуль работает с правильной версией установленного и включенного модуля 'Родословная роспись'. Пожалуйста, установите и включите 'Родословная роспись' версии %s или выше, чтобы использовать этот модуль. <a href="http://www.justcarmen.nl/fancy-modules/fancy-treeview/">Нажмите здесь, чтобы загрузить последнюю версию</a>.
sk: Nainštalovali ste modul Fancy Treeview PDF. Tento modul nebude fungovať bez správnej verzie modulu Fancy Treeview nainštalovaného a povoleného. Ak chcete tento modul použiť, nainštalujte a aktivujte verziu Fancy Treeview %s alebo vyššiu. <a href="http://www.justcarmen.nl/fancy-modules/fancy-treeview/"> Kliknutím sem stiahnite najnovšiu verziu </a>.

# FEMALE
source: adopted child
fr: enfant adopté
hu: örökbefogadott gyermek
nb: adoptert barn
ru: приемный ребенок
sk: adoptované dieťa

# MALE
source: adopted child
fr: enfant adopté
hu: örökbefogadott gyermek
nb: adoptert barn
ru: приемный ребенок
sk: adoptované dieťa

source: adopted child of
fr: enfant adopté de
hu: örökbefogadott gyermeke
nb: adoptert barn av
ru: приемный ребенок от
sk: adoptované dieťa z

source: adopted daughter of
fr: fille adopté de
hu: örökbefogadott lánya
nb: adoptert datter av
ru: приемная дочь из
sk: adoptovaná dcéra z

source: adopted son of
fr: fils adopté de
hu: örökbefogadott fia
nb: adoptert sønn av
ru: приемный сын из
sk: adoptovaný syn z

source: and
fr: et
hu: és
nb: og
ru: и
sk: a

# age in days/months
source: at the age of %s
fr: à l’âge de %s
hu: %s éves korában
nb: i en alder av %s år
ru: в возрасте %s
sk: vo veku %s

# age in years
source: at the age of %s
fr: à l’âge de %s ans
hu: %s éves korában
nb: i en alder av %s år
ru: в возрасте %s
sk: vo veku %s

source: cancel
fr: annuler
hu: mégse
nb: avbryt
ru: отменить
sk: zrušiť

source: child of
fr: enfant de
hu: fia
nb: barn av
ru: ребенок от
sk: dieťa z

# FEMALE
source: died
fr: morte
hu: elhunyt
nb: døde
ru: умерла
sk: zomrel

# MALE
source: died
fr: mort
hu: elhunyt
nb: døde
ru: умер
sk: zomrel

source: eighth
fr: huitième
hu: nyolcadik
nb: åttende
ru: восьмой
sk: ôsmy

source: fifth
fr: cinquième
hu: ötödik
nb: femte
ru: пятый
sk: piaty

source: first
fr: première
hu: első
nb: første
ru: первый
sk: prvý

source: follow
fr: suivant
nb: gå til
ru: перейти к
sk: nasledovať

# FEMALE
source: foster child
fr: fille adoptée
hu: fogadott gyermek
nb: fosterdatter
ru: воспитанница
sk: dieťa z detského domova

# MALE
source: foster child
fr: fils adopté
hu: fogadott gyermek
nb: fostersønn
ru: воспитанник
sk: dieťa z detského domova

source: foster child of
fr: enfant adopté de
hu: fogadott gyermeke
nb: fosterbarn
ru: воспитанник из
sk: dieťa z detského domova z

source: foster daughter of
fr: fille adoptée de
hu: fogadott lánya
nb: fosterdatter av
ru: приемная дочь из
sk: nevlastná dcéra

source: foster son of
fr: fils adopté de
hu: fogadott fia
nb: fostersønn av
ru: приемный сын из
sk: adoptovaný syn z

source: fourth
fr: quatrième
hu: negyedik
nb: fjerde
ru: четвертый
sk: štvrtý

# One parent/multiple children
source: had
fr: avait
hu: volt
nb: fikk
ru: имел
sk: mal

# One parent/one child
source: had
fr: avait
hu: volt
nb: fikk
ru: имел
sk: mal

# Two parents/multiple children
source: had
fr: avaient
hu: volt
nb: fikk
ru: имели
sk: mal

# Two parents/one child
source: had
fr: avaient
hu: volt
nb: fikk
ru: имели
sk: mal

# before dateformat mmm yyyy
source: in
fr: en
hu: hónapban
nb: i
ru: в
sk: v

# before dateformat yyyy
source: in
fr: en
hu: évben
nb: i
ru: в
sk: v

# before placesnames
source: in
fr: à
nb: i
ru: в
sk: v

source: ninth
fr: neuvième
hu: kilencedik
nb: niende
ru: девятый
sk: deviaty

source: ok
ru: ок

source: percent
fr: pourcent
hu: százalék
nb: prosent
ru: процент

source: save and copy options to other trees
fr: sauvergarder et copier les paramètres pour les autres arbres
nb: lagre og kopier innstillinger til andre slektstrær
ru: сохранить и скопировать параметры на другие деревья
sk: Uložte a kopírujte nastavenia na iné stromy

source: search
fr: rechercher
hu: keresés
nb: søk
ru: поиск
sk: vyhľadať

source: second
fr: deuxième
hu: második
nb: andre
ru: второй
sk: sekund

source: seventh
fr: septième
hu: hetedik
nb: syvende
ru: седьмой
sk: siedmy

source: sixth
fr: sixième
hu: hatodik
nb: sjette
ru: шестой
sk: šiesty

source: tenth
fr: dixième
hu: tizedik
nb: tiende
ru: десятый
sk: desiaty

source: third
fr: troisième
hu: harmadik
nb: tredje
ru: третий
sk: tretí

# PRESENT (MALE)
source: was bapitized
fr: a été baptisé
hu: keresztelve
nb: er døpt
ru: крещен
sk: bol pokrstený

# PAST (FEMALE)
source: was baptized
fr: a été baptisée
hu: keresztelve
nb: ble døpt
ru: крещена
sk: bol pokrstený

# PAST (MALE)
source: was baptized
fr: a été baptisé
hu: keresztelve
nb: ble døpt
ru: крестился
sk: bol pokrstený

# PRESENT (FEMALE)
source: was baptized
fr: a été baptisée
hu: keresztelve
nb: er døpt
ru: крестилась
sk: bol pokrstený

# PAST (FEMALE)
source: was born
fr: naquit
hu: Született
nb: ble født
ru: родилась
sk: narodil sa

# PAST (MALE)
source: was born
fr: naquit
hu: született
nb: ble født
ru: родился
sk: narodil sa

# PRESENT (FEMALE)
source: was born
fr: naît
hu: született
nb: er født
ru: родилась
sk: narodil sa

# PRESENT (MALE)
source: was born
fr: naît
hu: született
nb: er født
ru: родился
sk: narodil sa

# FEMALE
source: was buried
fr: a été enterrée
hu: eltemetve
nb: ble begravd
ru: была похоронена
sk: bol pochovaný

# MALE
source: was buried
fr: a été enterré
hu: eltemetve
nb: ble begravd
ru: был похоронен
sk: bol pochovaný

# FEMALE
source: was cremated
fr: a été incinérée
hu: elhamvasztva
nb: ble kremert
ru: кремирована
sk: bol spopolnený

# MALE
source: was cremated
fr: a été incinéré
hu: elhamvasztva
nb: ble kremert
ru: кремирован
sk: bol spopolnený

source: were divorced
fr: ont divorcé
hu: elváltak
nb: ble skilt
ru: были разведены
sk: boli rozvedení

# before dateformat dd-mm-yyyy
source: on
fr: le
hu: napja
nb: den
